emacs/pgpb/pgpb-nav.org
#+PROPERTY: header-args :results verbatim :tangle pgpb-nav.el :session pgpb-nav :cache no
#+auto_tangle: t


* pgpb-nav: [[file:pgpb-nav.el]]

  Efficient navigation for buffers, files, Org headings, etc.

** Pre-requisities

   
*** Helm: incremental completions framework: [[https://github.com/emacs-helm/helm][github]]
    
    #+begin_src elisp
      (use-package helm
        :ensure t
        :config
        (helm-mode 1))
    #+end_src


*** Projectile: project interaction library: [[https://github.com/bbatsov/projectile][github]]

    #+begin_src elisp
      (use-package projectile
        :ensure t
        :init
        (projectile-mode +1)
        (setq projectile-completion-system 'helm)
        :bind (:map projectile-mode-map
                    ("s-p" . projectile-command-map)
                    ("C-c j" . projectile-command-map))
        )
    #+end_src


*** imenu: create menus: [[https://www.emacswiki.org/emacs/ImenuMode][wiki]]

    #+begin_quote
    Imenu produces menus for accessing locations in documents,
    typically in the current buffer.  
    #+end_quote
    
     #+begin_src elisp
       (use-package imenu-anywhere
         :ensure t
         :bind (("C-." . 'helm-imenu-anywhere)))
     #+end_src


** helm-projectile: Helm UI for Projectile: [[https://github.com/bbatsov/helm-projectile][github]]

   #+begin_src elisp
     (use-package helm-projectile
       :ensure t
       :bind (("C-c g a" . 'helm-projectile-ack))
       :config
       (helm-projectile-on))
   #+end_src


** ivy: [[https://github.com/abo-abo/swiper][github]]

   #+begin_quote
   Ivy, a generic completion mechanism for Emacs.
   #+end_quote

   
*** Quickly switch to frame by name

    #+begin_src elisp
      (use-package ivy
        :ensure t
        :init
        (ivy-mode 1)
        :bind ("C-c f" . ivy-switch-frame)
        :custom
        (ivy-use-virtual-buffers t)
        (ivy-count-format "%d/%d ")
        (enable-recursive-minibuffers t))

      (defun ivy-switch-frame ()
        "Use Ivy to switch between visible Emacs frames."
        (interactive)
        (let ((frames (mapcar (lambda (frame)
                                (cons (frame-parameter frame 'name) frame))
                              (frame-list))))
          (ivy-read "Switch to frame: "
                    (mapcar 'car frames)
                    :action (lambda (name)
                              (select-frame-set-input-focus
                               (cdr (assoc name frames)))))))
    #+end_src


** Provide package
   
   #+begin_src elisp
     (provide 'pgpb-nav)
   #+end_src
